src/chapter-3.org
#+title:  Chapter 3
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *chapter-3* :tangle chapter_3.py

#+toc: headlines 2

* Setup
** Python Libraries
#+name: chapter-3-setup
#+begin_src python
  from typing import Literal, NewType, Optional
  from collections.abc import Callable

  from utils import TermColor
#+end_src

** Turing Machines
*** Introduction
#+name: chapter-3-gather-turing-machine-sources
#+begin_src python :exports none :noweb yes
  <<chapter-3-turing-machine-typing>>
  <<chapter-3-turing-parser>>
  <<chapter-3-turing-machine>>
#+end_src

In this section we define a class ~TuringMachine~ which empowers us to execute a turing program like
this one:

#+name: turing-program-constant-one
#+begin_example
# This program computes the function f(n)=1.
# Example: input="▶1001", output="▶1".
(S,▶,A,▶,+) # S is the start state
(A,0,A,■,+)
(A,1,A,■,+)
(A,■,B,■,-)
(B,■,B,■,-)
(B,▶,C,▶,+)
(C,■,H,1,0) # H is the halt state
#+end_example

#+name: source-tp-constant-one
#+begin_src python :var source_tp_constant_one=turing-program-constant-one :exports none
#+end_src

Below we initialize a turing machine ~my_tm~ from the above source code:

#+name: chapter-3-turing-machine-demo
#+begin_src python :var source=turing-program-constant-one :tangle no :results output replace
  my_tm = TuringMachine.fromSource(source, start_state="S", halt_state="H")
  my_tm.LOG_LEVEL = 3
  my_tm.COLORED_LOG = False  # set to false since listing below does not support colors

  result = my_tm.run("▶0")
  print(f"\nresult = '{result}'")
#+end_src

Setting ~LOG_LEVEL=3~ makes the Turing machine print certain informations for each step of
execution. The result can be seen in the following listing (with ~COLORED_LOG=True~ this would be
even more informative). Note that in theory the tape is infinite. We realize this by dynamically
allocating new blank cells whenever we want to access a cell not already allocated (we roughly
double the tape size in that case).

#+RESULTS: chapter-3-turing-machine-demo
#+begin_example

Executing step 1
tape = '▶0'
state='S', symbol='▶', head_position=0
source line = 2: (S,▶,A,▶,+) # S is the start state

Executing step 2
tape = '▶0'
state='A', symbol='0', head_position=1
source line = 3: (A,0,A,■,+)

Executing step 3
tape = '▶■■■■'
state='A', symbol='■', head_position=2
source line = 5: (A,■,B,■,-)

Executing step 4
tape = '▶■■■■'
state='B', symbol='■', head_position=1
source line = 6: (B,■,B,■,-)

Executing step 5
tape = '▶■■■■'
state='B', symbol='▶', head_position=0
source line = 7: (B,▶,C,▶,+)

Executing step 6
tape = '▶■■■■'
state='C', symbol='■', head_position=1
source line = 8: (C,■,H,1,0) # H is the halt state

Execution took 6 steps.

result = '▶1'
#+end_example

