src/chapter-3.org
*** Implementation
First we introduce some useful types. We represent the state by strings since this /allows/ for
readable or at least mnemonic state names. This would not be possible had we used integers. The
~SourceMap~ is responsible for connecting each parsed line of the turing program with its original
from the source-string/file. It is the reason why in the [[chapter-3-turing-machine-demo][listing above]] the ~TuringMachine~ instance
can refer to its source (see the line starting with =source line ==).

#+name: chapter-3-turing-machine-typing
#+begin_src python :tangle no :eval no
  Char = NewType("Char", str)  # better than nothing, represents a letter from the alphabet
  State = NewType("State", str)
  Move = Literal[-1, 0, +1]
  TuringProgLine = tuple[State, Char, State, Char, Move]  # (s,c,s',c',m)
  TuringProgram = list[TuringProgLine]

  SourceMap = list[tuple[int, str]]
  TuringParser = Callable[[str], [tuple[TuringProgram, SourceMap | None]]]
#+end_src

[[chapter-3-turing-machine][Below]] follows the implementation of the ~TuringMachine~. The logging functionality bloats the
implementation a bit. But it you ignore this the implementation is very simple and straightforward
to understand (IMHO).

Note that the ~__init__~ method takes the program as an already parsed list of tuples
(~TuringProgram~). The canonical way to create a ~TuringMachine~ is to use the ~fromSource~ factory
method. Among other things you can optionally provide a custom parser. This might be beneficial to
introduce syntactic sugar. For example the code snippit

#+begin_example
(a,0,a,0,+)
(a,1,a,1,+)
(a,2,a,2,+)
(a,3,a,3,+)
(a,4,a,4,+)
(a,5,a,5,+)
#+end_example

might seem somewhat verbose. Probably this would be nicer syntax:

#+begin_example
(a,0|1|2|3|4|5,a,$,+)  # "$" meaning: take the original
# or even (if this is the intended meaning)
(a,*,a,$,+)  # "*" meaning: match all
#+end_example

Another reason to use a custom parser would be to circumvent some restrictions of the default
parser. For example the default parser treats the symbols =#=, =,=, =(=, =)= in a special way. In
particular, those cannot be used as characters on the tape.

#+name: chapter-3-turing-machine
#+begin_src python :tangle no :eval no
  class TuringMachine:
      """Given a turing program produces the corresponding turing machine."""
      BLANK: Char = "■"  # Special symbol for the blank cell. Is used when tape dynamically grows.
      MAX_STEPS = 1000000  # Abort after running this many steps
      LOG_LEVEL = 0  # Set greater 0 for a chatty execution
      COLORED_LOG = True  # Turn of if environment does not support colors
      SOURCE_LINE_OFFSET = 0  # SourceMap assumes that source file start with line 0. Adjust this here.

      def __init__(self, program: TuringProgram,
                   start_state: State = "START", halt_state: State = "HALT",
                   source_map: Optional[SourceMap] = None):
          self._start_state = start_state
          self._halt_state = halt_state
          self._program = program
          self._source_map = source_map

          assert source_map is None or len(source_map) == len(program), "Invalid source_map"

          self._state = None
          self._head_position: int = None
          self._tape: list[Char] = []  # gets input during execution
          self._step_count = None

          # Only relevant for logging:
          self._index_width = len(str(len(self._program)-1))

      @classmethod
      def fromSource(cls, source: str,
                     start_state: State = "START", halt_state: State = "HALT",
                     parser: TuringParser = parse_turing_program) -> "TuringMachine":
          """Create a turing machine from a source string. You can provide a custom parser."""
          program, source_map = parser(source)
          return TuringMachine(program,
                               start_state=start_state, halt_state=halt_state,
                               source_map=source_map)

      def run(self, tape_input: str) -> str:
          """Run the TM and return what is on the tape after it halts."""
          self._state = self._start_state
          self._head_position = 0
          self._tape = list(tape_input)
          self._step_count = 0

          while self._state != self._halt_state:
              if self._step_count > self.MAX_STEPS:
                  raise Exception("Turing machine takes too long. Aborting.")
              self._step_count += 1
              self._log(2, f"\nExecuting step {self._step_count}")
              self._run_one_step()

          self._log(1, f"\nExecution took {self._step_count} steps.")

          return self._tape_content.strip(self.BLANK)

      @property
      def _line_no_width(self):  # only relevant for logging
          return None if self._source_map is None \
              else len(str(self._source_map[-1][0] + self.SOURCE_LINE_OFFSET - 1))

      def _log(self, level, *args, **kwargs):
          if self.LOG_LEVEL >= level:
              print(*args, **kwargs)

      def _run_one_step(self) -> None:
          self._log(3, f"tape = '{self._colored_tape_content}'")
          current_line = self._current_program_line

          if current_line is None:
              RED, ENDC = (TermColor.RED, TermColor.ENDC) if self.COLORED_LOG else ("", "")
              self._log(2, f"{RED}No matching program line - halting{ENDC}")
              self._state = self._halt_state
              return

          index, current_line = current_line
          self._log(4, f"program line = {index:{self._index_width}}: {current_line}")

          if self._source_map is not None:
              line_no, source_line = self._source_map[index]
              line_no += self.SOURCE_LINE_OFFSET
              self._log(3, f"source line = {line_no:{self._line_no_width}}: {source_line}")

          s1, c1, m = current_line[2:]

          self._state = s1
          self._head_symbol = c1
          # avoid negative positions:
          self._head_position = max(self._head_position + m, 0)

      @property
      def _tape_content(self) -> str:
          return "".join(self._tape)

      @property
      def _colored_tape_content(self) -> str:
          self._enlarge_tape_if_necessary()
          text = self._tape_content
          pos = self._head_position
          GREEN, ENDC = (TermColor.GREEN, TermColor.ENDC) if self.COLORED_LOG else ("", "")
          return text[:pos] + GREEN + text[pos] + ENDC + text[pos+1:]

      @property
      def _current_program_line(self) -> tuple[int, TuringProgLine]:
          s0, c0 = self._state, self._head_symbol
          self._log(2, f"state='{s0}', symbol='{c0}', head_position={self._head_position}")
          for i, line in enumerate(self._program):
              s, c = line[:2]
              if s0 == s and c0 == c:
                  return i, line

          return None

      @property
      def _head_symbol(self) -> Char:
          self._enlarge_tape_if_necessary()
          return self._tape[self._head_position]

      @_head_symbol.setter
      def _head_symbol(self, new_symbol) -> Char:
          self._enlarge_tape_if_necessary()  # just being paranoid
          self._tape[self._head_position] = new_symbol

      def _enlarge_tape_if_necessary(self) -> None:
          """Call this to ensure that our finite tape can actually be accessed at head position."""
          pos = self._head_position
          while pos >= len(self._tape):  # only one loop usually suffices
              some_blanks = [self.BLANK] * (1 + len(self._tape))
              self._tape += some_blanks  # double tape size
#+end_src

Finally, the default parser:

#+name: chapter-3-turing-parser
#+begin_src python :tangle no :eval no
  def parse_turing_program_line(line: str) -> TuringProgLine | None:
      """Parse a single line of the form `(s,c,s',c',m)` (up to comments).

      Empty or comment lines are ignored by returning `None`."""
      # Remove comments and leading/trailing whitespace
      line = line[:line.find('#')].strip()
      if len(line) == 0:
          return None  # line comment or empty line

      line = line.strip().lstrip("(").rstrip(")")
      s0, c0, s1, c1, m = line.split(",")
      m = +1 if m == "+" else m  # for convinience ...
      m = -1 if m == "-" else m  # ... allow shortcuts for +1, -1
      m = int(m)
      assert len(c0) == 1, f"Expected character got '{c0}'."
      assert len(c1) == 1, f"Expected character got '{c1}'."
      assert m in [-1, 0, +1], f"Forbidden head movement: {m}."

      return s0, c0, s1, c1, m


  def parse_turing_program(source: str) -> tuple[TuringProgram, SourceMap]:
      """Parses the source of a turing program line by line."""
      program: TuringProgram = []
      source_map: list[int] = []

      lines = source.split("\n")
      for line_no, line in enumerate(lines):
          try:
              parsed_line = parse_turing_program_line(line)
          except Exception:
              # Probably good enough for such a simple language:
              raise Exception(f"Could not parse line {line_no}: '{line}'")

          if parsed_line is not None:
              program.append(parsed_line)
              source_map.append((line_no, line))

      return program, source_map
#+end_src

