chapter-3.html

<div id="outline-container-org1412bdb" class="outline-4">
<h4 id="org1412bdb">Implementation</h4>
<div class="outline-text-4" id="text-org1412bdb">
<p>
First we introduce some useful types. We represent the state by strings since this <i>allows</i> for
readable or at least mnemonic state names. This would not be possible had we used integers. The
<code>SourceMap</code> is responsible for connecting each parsed line of the turing program with its original
from the source-string/file. It is the reason why in the <a href="#org57ffe09">listing above</a> the <code>TuringMachine</code> instance
can refer to its source (see the line starting with <code>source line =</code>).
</p>

<div class="org-src-container">
<pre class="src src-python" id="org95e451b"><span class="org-variable-name">Char</span> = NewType(<span class="org-string">"Char"</span>, <span class="org-builtin">str</span>)  <span class="org-comment-delimiter"># </span><span class="org-comment">better than nothing, represents a letter from the alphabet</span>
<span class="org-variable-name">State</span> = NewType(<span class="org-string">"State"</span>, <span class="org-builtin">str</span>)
<span class="org-variable-name">Move</span> = Literal[-1, 0, +1]
<span class="org-variable-name">TuringProgLine</span> = <span class="org-builtin">tuple</span>[State, Char, State, Char, Move]  <span class="org-comment-delimiter"># </span><span class="org-comment">(s,c,s',c',m)</span>
<span class="org-variable-name">TuringProgram</span> = <span class="org-builtin">list</span>[TuringProgLine]

<span class="org-variable-name">SourceMap</span> = <span class="org-builtin">list</span>[<span class="org-builtin">tuple</span>[<span class="org-builtin">int</span>, <span class="org-builtin">str</span>]]
<span class="org-variable-name">TuringParser</span> = Callable[[<span class="org-builtin">str</span>], [<span class="org-builtin">tuple</span>[TuringProgram, SourceMap | <span class="org-constant">None</span>]]]
</pre>
</div>

<p>
<a href="#orgb2a521e">Below</a> follows the implementation of the <code>TuringMachine</code>. The logging functionality bloats the
implementation a bit. But it you ignore this the implementation is very simple and straightforward
to understand (IMHO).
</p>

<p>
Note that the <code>__init__</code> method takes the program as an already parsed list of tuples
(<code>TuringProgram</code>). The canonical way to create a <code>TuringMachine</code> is to use the <code>fromSource</code> factory
method. Among other things you can optionally provide a custom parser. This might be beneficial to
introduce syntactic sugar. For example the code snippit
</p>

<pre class="example">
(a,0,a,0,+)
(a,1,a,1,+)
(a,2,a,2,+)
(a,3,a,3,+)
(a,4,a,4,+)
(a,5,a,5,+)
</pre>

<p>
might seem somewhat verbose. Probably this would be nicer syntax:
</p>

<pre class="example">
(a,0|1|2|3|4|5,a,$,+)  # "$" meaning: take the original
# or even (if this is the intended meaning)
(a,*,a,$,+)  # "*" meaning: match all
</pre>

<p>
Another reason to use a custom parser would be to circumvent some restrictions of the default
parser. For example the default parser treats the symbols <code>#</code>, <code>,</code>, <code>(</code>, <code>)</code> in a special way. In
particular, those cannot be used as characters on the tape.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgb2a521e"><span class="org-keyword">class</span> <span class="org-type">TuringMachine</span>:
    <span class="org-doc">"""Given a turing program produces the corresponding turing machine."""</span>
    BLANK: <span class="org-variable-name">Char</span> = <span class="org-string">"&#9632;"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">Special symbol for the blank cell. Is used when tape dynamically grows.</span>
    <span class="org-variable-name">MAX_STEPS</span> = 1000000  <span class="org-comment-delimiter"># </span><span class="org-comment">Abort after running this many steps</span>
    <span class="org-variable-name">LOG_LEVEL</span> = 0  <span class="org-comment-delimiter"># </span><span class="org-comment">Set greater 0 for a chatty execution</span>
    <span class="org-variable-name">COLORED_LOG</span> = <span class="org-constant">True</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">Turn of if environment does not support colors</span>
    <span class="org-variable-name">SOURCE_LINE_OFFSET</span> = 0  <span class="org-comment-delimiter"># </span><span class="org-comment">SourceMap assumes that source file start with line 0. Adjust this here.</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, program: TuringProgram,
                 start_state: State = <span class="org-string">"START"</span>, halt_state: State = <span class="org-string">"HALT"</span>,
                 source_map: Optional[SourceMap] = <span class="org-constant">None</span>):
        <span class="org-keyword">self</span>._start_state = start_state
        <span class="org-keyword">self</span>._halt_state = halt_state
        <span class="org-keyword">self</span>._program = program
        <span class="org-keyword">self</span>._source_map = source_map

        <span class="org-keyword">assert</span> source_map <span class="org-keyword">is</span> <span class="org-constant">None</span> <span class="org-keyword">or</span> <span class="org-builtin">len</span>(source_map) == <span class="org-builtin">len</span>(program), <span class="org-string">"Invalid source_map"</span>

        <span class="org-keyword">self</span>._state = <span class="org-constant">None</span>
        <span class="org-keyword">self</span>._head_position: <span class="org-builtin">int</span> = <span class="org-constant">None</span>
        <span class="org-keyword">self</span>._tape: <span class="org-builtin">list</span>[Char] = []  <span class="org-comment-delimiter"># </span><span class="org-comment">gets input during execution</span>
        <span class="org-keyword">self</span>._step_count = <span class="org-constant">None</span>

        <span class="org-comment-delimiter"># </span><span class="org-comment">Only relevant for logging:</span>
        <span class="org-keyword">self</span>._index_width = <span class="org-builtin">len</span>(<span class="org-builtin">str</span>(<span class="org-builtin">len</span>(<span class="org-keyword">self</span>._program)-1))

    @<span class="org-builtin">classmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">fromSource</span>(cls, source: <span class="org-builtin">str</span>,
                   start_state: State = <span class="org-string">"START"</span>, halt_state: State = <span class="org-string">"HALT"</span>,
                   parser: TuringParser = parse_turing_program) -&gt; <span class="org-string">"TuringMachine"</span>:
        <span class="org-doc">"""Create a turing machine from a source string. You can provide a custom parser."""</span>
        <span class="org-variable-name">program</span>, <span class="org-variable-name">source_map</span> = parser(source)
        <span class="org-keyword">return</span> TuringMachine(program,
                             start_state=start_state, halt_state=halt_state,
                             source_map=source_map)

    <span class="org-keyword">def</span> <span class="org-function-name">run</span>(<span class="org-keyword">self</span>, tape_input: <span class="org-builtin">str</span>) -&gt; <span class="org-builtin">str</span>:
        <span class="org-doc">"""Run the TM and return what is on the tape after it halts."""</span>
        <span class="org-keyword">self</span>._state = <span class="org-keyword">self</span>._start_state
        <span class="org-keyword">self</span>._head_position = 0
        <span class="org-keyword">self</span>._tape = <span class="org-builtin">list</span>(tape_input)
        <span class="org-keyword">self</span>._step_count = 0

        <span class="org-keyword">while</span> <span class="org-keyword">self</span>._state != <span class="org-keyword">self</span>._halt_state:
            <span class="org-keyword">if</span> <span class="org-keyword">self</span>._step_count &gt; <span class="org-keyword">self</span>.MAX_STEPS:
                <span class="org-keyword">raise</span> <span class="org-type">Exception</span>(<span class="org-string">"Turing machine takes too long. Aborting."</span>)
            <span class="org-keyword">self</span>._step_count += 1
            <span class="org-keyword">self</span>._log(2, f<span class="org-string">"\nExecuting step {self._step_count}"</span>)
            <span class="org-keyword">self</span>._run_one_step()

        <span class="org-keyword">self</span>._log(1, f<span class="org-string">"\nExecution took {self._step_count} steps."</span>)

        <span class="org-keyword">return</span> <span class="org-keyword">self</span>._tape_content.strip(<span class="org-keyword">self</span>.BLANK)

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_line_no_width</span>(<span class="org-keyword">self</span>):  <span class="org-comment-delimiter"># </span><span class="org-comment">only relevant for logging</span>
        <span class="org-keyword">return</span> <span class="org-constant">None</span> <span class="org-keyword">if</span> <span class="org-keyword">self</span>._source_map <span class="org-keyword">is</span> <span class="org-constant">None</span> \
            <span class="org-keyword">else</span> <span class="org-builtin">len</span>(<span class="org-builtin">str</span>(<span class="org-keyword">self</span>._source_map[-1][0] + <span class="org-keyword">self</span>.SOURCE_LINE_OFFSET - 1))

    <span class="org-keyword">def</span> <span class="org-function-name">_log</span>(<span class="org-keyword">self</span>, level, *args, **kwargs):
        <span class="org-keyword">if</span> <span class="org-keyword">self</span>.LOG_LEVEL &gt;= level:
            <span class="org-keyword">print</span>(*args, **kwargs)

    <span class="org-keyword">def</span> <span class="org-function-name">_run_one_step</span>(<span class="org-keyword">self</span>) -&gt; <span class="org-constant">None</span>:
        <span class="org-keyword">self</span>._log(3, f<span class="org-string">"tape = '{self._colored_tape_content}'"</span>)
        <span class="org-variable-name">current_line</span> = <span class="org-keyword">self</span>._current_program_line

        <span class="org-keyword">if</span> current_line <span class="org-keyword">is</span> <span class="org-constant">None</span>:
            <span class="org-variable-name">RED</span>, <span class="org-variable-name">ENDC</span> = (TermColor.RED, TermColor.ENDC) <span class="org-keyword">if</span> <span class="org-keyword">self</span>.COLORED_LOG <span class="org-keyword">else</span> (<span class="org-string">""</span>, <span class="org-string">""</span>)
            <span class="org-keyword">self</span>._log(2, f<span class="org-string">"{RED}No matching program line - halting{ENDC}"</span>)
            <span class="org-keyword">self</span>._state = <span class="org-keyword">self</span>._halt_state
            <span class="org-keyword">return</span>

        <span class="org-variable-name">index</span>, <span class="org-variable-name">current_line</span> = current_line
        <span class="org-keyword">self</span>._log(4, f<span class="org-string">"program line = {index:{self._index_width}}: {current_line}"</span>)

        <span class="org-keyword">if</span> <span class="org-keyword">self</span>._source_map <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-constant">None</span>:
            <span class="org-variable-name">line_no</span>, <span class="org-variable-name">source_line</span> = <span class="org-keyword">self</span>._source_map[index]
            <span class="org-variable-name">line_no</span> += <span class="org-keyword">self</span>.SOURCE_LINE_OFFSET
            <span class="org-keyword">self</span>._log(3, f<span class="org-string">"source line = {line_no:{self._line_no_width}}: {source_line}"</span>)

        <span class="org-variable-name">s1</span>, <span class="org-variable-name">c1</span>, <span class="org-variable-name">m</span> = current_line[2:]

        <span class="org-keyword">self</span>._state = s1
        <span class="org-keyword">self</span>._head_symbol = c1
        <span class="org-comment-delimiter"># </span><span class="org-comment">avoid negative positions:</span>
        <span class="org-keyword">self</span>._head_position = <span class="org-builtin">max</span>(<span class="org-keyword">self</span>._head_position + m, 0)

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_tape_content</span>(<span class="org-keyword">self</span>) -&gt; <span class="org-builtin">str</span>:
        <span class="org-keyword">return</span> <span class="org-string">""</span>.join(<span class="org-keyword">self</span>._tape)

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_colored_tape_content</span>(<span class="org-keyword">self</span>) -&gt; <span class="org-builtin">str</span>:
        <span class="org-keyword">self</span>._enlarge_tape_if_necessary()
        <span class="org-variable-name">text</span> = <span class="org-keyword">self</span>._tape_content
        <span class="org-variable-name">pos</span> = <span class="org-keyword">self</span>._head_position
        <span class="org-variable-name">GREEN</span>, <span class="org-variable-name">ENDC</span> = (TermColor.GREEN, TermColor.ENDC) <span class="org-keyword">if</span> <span class="org-keyword">self</span>.COLORED_LOG <span class="org-keyword">else</span> (<span class="org-string">""</span>, <span class="org-string">""</span>)
        <span class="org-keyword">return</span> text[:pos] + GREEN + text[pos] + ENDC + text[pos+1:]

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_current_program_line</span>(<span class="org-keyword">self</span>) -&gt; <span class="org-builtin">tuple</span>[<span class="org-builtin">int</span>, TuringProgLine]:
        <span class="org-variable-name">s0</span>, <span class="org-variable-name">c0</span> = <span class="org-keyword">self</span>._state, <span class="org-keyword">self</span>._head_symbol
        <span class="org-keyword">self</span>._log(2, f<span class="org-string">"state='{s0}', symbol='{c0}', head_position={self._head_position}"</span>)
        <span class="org-keyword">for</span> i, line <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(<span class="org-keyword">self</span>._program):
            <span class="org-variable-name">s</span>, <span class="org-variable-name">c</span> = line[:2]
            <span class="org-keyword">if</span> s0 == s <span class="org-keyword">and</span> c0 == c:
                <span class="org-keyword">return</span> i, line

        <span class="org-keyword">return</span> <span class="org-constant">None</span>

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_head_symbol</span>(<span class="org-keyword">self</span>) -&gt; Char:
        <span class="org-keyword">self</span>._enlarge_tape_if_necessary()
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>._tape[<span class="org-keyword">self</span>._head_position]

    <span class="org-type">@_head_symbol.setter</span>
    <span class="org-keyword">def</span> <span class="org-function-name">_head_symbol</span>(<span class="org-keyword">self</span>, new_symbol) -&gt; Char:
        <span class="org-keyword">self</span>._enlarge_tape_if_necessary()  <span class="org-comment-delimiter"># </span><span class="org-comment">just being paranoid</span>
        <span class="org-keyword">self</span>._tape[<span class="org-keyword">self</span>._head_position] = new_symbol

    <span class="org-keyword">def</span> <span class="org-function-name">_enlarge_tape_if_necessary</span>(<span class="org-keyword">self</span>) -&gt; <span class="org-constant">None</span>:
        <span class="org-doc">"""Call this to ensure that our finite tape can actually be accessed at head position."""</span>
        <span class="org-variable-name">pos</span> = <span class="org-keyword">self</span>._head_position
        <span class="org-keyword">while</span> pos &gt;= <span class="org-builtin">len</span>(<span class="org-keyword">self</span>._tape):  <span class="org-comment-delimiter"># </span><span class="org-comment">only one loop usually suffices</span>
            <span class="org-variable-name">some_blanks</span> = [<span class="org-keyword">self</span>.BLANK] * (1 + <span class="org-builtin">len</span>(<span class="org-keyword">self</span>._tape))
            <span class="org-keyword">self</span>._tape += some_blanks  <span class="org-comment-delimiter"># </span><span class="org-comment">double tape size</span>
</pre>
</div>

<p>
Finally, the default parser:
</p>

<div class="org-src-container">
<pre class="src src-python" id="org051929f"><span class="org-keyword">def</span> <span class="org-function-name">parse_turing_program_line</span>(line: <span class="org-builtin">str</span>) -&gt; TuringProgLine | <span class="org-constant">None</span>:
    <span class="org-doc">"""Parse a single line of the form `(s,c,s',c',m)` (up to comments).</span>

<span class="org-doc">    Empty or comment lines are ignored by returning `None`."""</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Remove comments and leading/trailing whitespace</span>
    <span class="org-variable-name">line</span> = line[:line.find(<span class="org-string">'#'</span>)].strip()
    <span class="org-keyword">if</span> <span class="org-builtin">len</span>(line) == 0:
        <span class="org-keyword">return</span> <span class="org-constant">None</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">line comment or empty line</span>

    <span class="org-variable-name">line</span> = line.strip().lstrip(<span class="org-string">"("</span>).rstrip(<span class="org-string">")"</span>)
    <span class="org-variable-name">s0</span>, <span class="org-variable-name">c0</span>, <span class="org-variable-name">s1</span>, <span class="org-variable-name">c1</span>, <span class="org-variable-name">m</span> = line.split(<span class="org-string">","</span>)
    <span class="org-variable-name">m</span> = +1 <span class="org-keyword">if</span> m == <span class="org-string">"+"</span> <span class="org-keyword">else</span> m  <span class="org-comment-delimiter"># </span><span class="org-comment">for convinience ...</span>
    <span class="org-variable-name">m</span> = -1 <span class="org-keyword">if</span> m == <span class="org-string">"-"</span> <span class="org-keyword">else</span> m  <span class="org-comment-delimiter"># </span><span class="org-comment">... allow shortcuts for +1, -1</span>
    <span class="org-variable-name">m</span> = <span class="org-builtin">int</span>(m)
    <span class="org-keyword">assert</span> <span class="org-builtin">len</span>(c0) == 1, f<span class="org-string">"Expected character got '{c0}'."</span>
    <span class="org-keyword">assert</span> <span class="org-builtin">len</span>(c1) == 1, f<span class="org-string">"Expected character got '{c1}'."</span>
    <span class="org-keyword">assert</span> m <span class="org-keyword">in</span> [-1, 0, +1], f<span class="org-string">"Forbidden head movement: {m}."</span>

    <span class="org-keyword">return</span> s0, c0, s1, c1, m


<span class="org-keyword">def</span> <span class="org-function-name">parse_turing_program</span>(source: <span class="org-builtin">str</span>) -&gt; <span class="org-builtin">tuple</span>[TuringProgram, SourceMap]:
    <span class="org-doc">"""Parses the source of a turing program line by line."""</span>
    program: <span class="org-variable-name">TuringProgram</span> = []
    source_map: <span class="org-builtin">list</span>[<span class="org-builtin">int</span>] = []

    <span class="org-variable-name">lines</span> = source.split(<span class="org-string">"\n"</span>)
    <span class="org-keyword">for</span> line_no, line <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(lines):
        <span class="org-keyword">try</span>:
            <span class="org-variable-name">parsed_line</span> = parse_turing_program_line(line)
        <span class="org-keyword">except</span> <span class="org-type">Exception</span>:
            <span class="org-comment-delimiter"># </span><span class="org-comment">Probably good enough for such a simple language:</span>
            <span class="org-keyword">raise</span> <span class="org-type">Exception</span>(f<span class="org-string">"Could not parse line {line_no}: '{line}'"</span>)

        <span class="org-keyword">if</span> parsed_line <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-constant">None</span>:
            program.append(parsed_line)
            source_map.append((line_no, line))

    <span class="org-keyword">return</span> program, source_map
</pre>
</div>
</div>
</div>
</div>
</div>
