src/chapter-3.org
* WIP Exercises
** TODO Exercise 3.1 (Non-computable processes in Nature)
How might we recognize that a process in Nature computes a function not computable by a Turing
machine?

** Exercise 3.2 (Turing numbers)
Show that single-tape Turing machines can each be given a number from the list $1,2,3,\ldots$ in
such a way that the number uniquely specifies the corresponding machine. We call this number the
Turing number of the corresponding Turing machine. (/Hint/: Every positive integer has a unique
prime factorization $p_1^{a_1}p_2^{a_2}\cdots p_k^{a_k}$, where $p_i$ are distinct prime numbers,
and $a_1,a_2,\ldots,a_k$ are non-negative integers.)

*** Proof
For simplicity we assume that the state space and the alphabet are fixed for all Turing machines we
consider (one could easily relax this constraint without complicating the encoding). Hence we need
to encode the start state, the halt state and the program into a single number. This is sufficient
to describe the Turing Machine. We follow the proposal to use prime numbers for that. Therefore let
us enumerate the prime numbers starting by $2$: $p_1=2$, $p_2=3$, ..., $p_5=11$, ... .

This procedure is certainly not the most efficient one but it serves the purpose to show that all
Turing machines (satsifying a specific definition/architecture) can be /effectively/
enumerated. That is, there is an /algorithm/ (which could potentially run on a Turing machine),
which assigns numbers to each Turing machine. Moreover this assignment is invertible and the inverse
mapping (numbers to Turing machines) can be computed by an /algorithm/ too.

Let us identify the states $S$ and the elements of the alphabet $\Gamma$ with integers:

$$
  S = \{0, 1, 2, \ldots\} ; \quad \Gamma = \{0, 1, 2, \ldots\} .
$$

Moreover, we encode the possible movements by $\{0,1,2\}$, meaning /left/, /stay/, /right/ in that
order. We encode the start state $s\in\NN$ and the halt state $h\in\NN$ by

$$
  p_1^s \text{ and } p_2^h .
$$

The $i$​-th program line

$$
  (q_i,c_i,q'_i,c'_i,m_i) \in \NN^4\times\{0,1,2\}
$$

can be encoded by

$$
  l_i = p_{5i+3}^{q_i} \, p_{5i+4}^{c_i} \, p_{5i+5}^{q'_i} \, p_{5i+6}^{c'_i} \, p_{5i+7}^{m_i} .
$$

The whole program is then encoded by the product $\Pi_il_i$ and the Turing machine itself by
$p_1^s\,p_2^h\,\Pi_il_i$. Since prime factorization of integers is unique, this encoding is
invertible and hence the Turing machine can be recovered from this (potentially large) number. QED.

** Exercise 3.3 (Turing machine to reverse a bit string)
Describe a Turing machine which takes a binary number $x$ as input, and outputs the bits of $x$ in
reverse order. (Hint: In this exercise and the next it may help to use a multi-tape Turing machine
and/or symbols other than ▶, 0, 1, and the blank.)

