chapter-3.html

<div id="outline-container-org3167525" class="outline-2">
<h2 id="org3167525"><span class="todo WIP">WIP</span> Exercises</h2>
<div class="outline-text-2" id="text-org3167525">
</div>
<div id="outline-container-orgf6d8069" class="outline-3">
<h3 id="orgf6d8069"><span class="todo TODO">TODO</span> Exercise 3.1 (Non-computable processes in Nature)</h3>
<div class="outline-text-3" id="text-orgf6d8069">
<p>
How might we recognize that a process in Nature computes a function not computable by a Turing
machine?
</p>
</div>
</div>

<div id="outline-container-org583f46d" class="outline-3">
<h3 id="org583f46d">Exercise 3.2 (Turing numbers)</h3>
<div class="outline-text-3" id="text-org583f46d">
<p>
Show that single-tape Turing machines can each be given a number from the list \(1,2,3,\ldots\) in
such a way that the number uniquely specifies the corresponding machine. We call this number the
Turing number of the corresponding Turing machine. (<i>Hint</i>: Every positive integer has a unique
prime factorization \(p_1^{a_1}p_2^{a_2}\cdots p_k^{a_k}\), where \(p_i\) are distinct prime numbers,
and \(a_1,a_2,\ldots,a_k\) are non-negative integers.)
</p>
</div>

<div id="outline-container-org2fee88f" class="outline-4">
<h4 id="org2fee88f">Proof</h4>
<div class="outline-text-4" id="text-org2fee88f">
<p>
For simplicity we assume that the state space and the alphabet are fixed for all Turing machines we
consider (one could easily relax this constraint without complicating the encoding). Hence we need
to encode the start state, the halt state and the program into a single number. This is sufficient
to describe the Turing Machine. We follow the proposal to use prime numbers for that. Therefore let
us enumerate the prime numbers starting by \(2\): \(p_1=2\), \(p_2=3\), &#x2026;, \(p_5=11\), &#x2026; .
</p>

<p>
This procedure is certainly not the most efficient one but it serves the purpose to show that all
Turing machines (satsifying a specific definition/architecture) can be <i>effectively</i>
enumerated. That is, there is an <i>algorithm</i> (which could potentially run on a Turing machine),
which assigns numbers to each Turing machine. Moreover this assignment is invertible and the inverse
mapping (numbers to Turing machines) can be computed by an <i>algorithm</i> too.
</p>

<p>
Let us identify the states \(S\) and the elements of the alphabet \(\Gamma\) with integers:
</p>

<p>
\[
  S = \{0, 1, 2, \ldots\} ; \quad \Gamma = \{0, 1, 2, \ldots\} .
\]
</p>

<p>
Moreover, we encode the possible movements by \(\{0,1,2\}\), meaning <i>left</i>, <i>stay</i>, <i>right</i> in that
order. We encode the start state \(s\in\NN\) and the halt state \(h\in\NN\) by
</p>

<p>
\[
  p_1^s \text{ and } p_2^h .
\]
</p>

<p>
The \(i\)​-th program line
</p>

<p>
\[
  (q_i,c_i,q'_i,c'_i,m_i) \in \NN^4\times\{0,1,2\}
\]
</p>

<p>
can be encoded by
</p>

<p>
\[
  l_i = p_{5i+3}^{q_i} \, p_{5i+4}^{c_i} \, p_{5i+5}^{q'_i} \, p_{5i+6}^{c'_i} \, p_{5i+7}^{m_i} .
\]
</p>

<p>
The whole program is then encoded by the product \(\Pi_il_i\) and the Turing machine itself by
\(p_1^s\,p_2^h\,\Pi_il_i\). Since prime factorization of integers is unique, this encoding is
invertible and hence the Turing machine can be recovered from this (potentially large) number. QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org8b4e8d9" class="outline-3">
<h3 id="org8b4e8d9">Exercise 3.3 (Turing machine to reverse a bit string)</h3>
<div class="outline-text-3" id="text-org8b4e8d9">
<p>
Describe a Turing machine which takes a binary number \(x\) as input, and outputs the bits of \(x\) in
reverse order. (Hint: In this exercise and the next it may help to use a multi-tape Turing machine
and/or symbols other than ▶, 0, 1, and the blank.)
</p>
</div>
